Tekla Open API Reference for Tekla Structures 2025
DrawingObjectSelector.UnselectObjects Method
 Unselects the specified drawing objects keeping the other objects still selected.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UnselectObjects(
	ArrayList DrawingObjects
)
Public Function UnselectObjects (
	DrawingObjects As ArrayList
) As Boolean
Parameters
DrawingObjects
Type: System.Collections.ArrayList
The drawing objects to be unselected.
Return Value
Type: Boolean
True if succeeded.
See Also
Reference
DrawingObjectSelector Class
Tekla.Structures.Drawing.UI Namespace